backend/app/controllers/events_controller.rb

  def index
    # イベントデータの一覧を返す
    render json: Event.all.to_json(include: :calendar)
---
SELECT `events`.* FROM `events`

  def show
    render json: Event.find(params[:id]).to_json(include: :calendar)
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1

  def create
    # パラメータの値でイベントデータを作成する
    event = Event.new(event_params)
    if event.save
---
INSERT INTO `events` (`name`, `start`, `end`, `created_at`, `updated_at`) VALUES ('curlから作成した予定', '2020-10-11 10:00:00', '2020-10-11 11:00:00', '2021-08-26 02:18:08.867354', '2021-08-26 02:18:08.867354')

  def update
    # パラメータの値でイベントデータを更新する
    event = Event.find(params[:id])
    if event.update(event_params)
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 5 LIMIT 1
UPDATE `events` SET `events`.`name` = 'curlから更新した予定', `events`.`updated_at` = '2021-08-26 02:21:58.870181' WHERE `events`.`id` = 5

  def destroy
    # パラメータの値でイベントデータを更新する
    event = Event.find(params[:id])
    # if event.destroy
    #   render json: Event.all
    # else
    #   render json: event.errors, status: 422
    # end
    event.destroy!
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 4 LIMIT 1
DELETE FROM `events` WHERE `events`.`id` = 4